index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ruben's Site</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Ruben's Site</h1>
<nav>
  <a href="#socials">Socials</a> | 
  <a href="#endeavors">Endeavors</a> | 
  <a href="#blogs">Blog</a>
</nav>

<div id="outline-container-socials" class="outline-2">
<h2 id="socials">Socials</h2>
<div class="outline-text-2" id="text-socials">
<ul class="org-ul">
<li><a href="https://www.youtube.com/@BehindRuben">YouTube</a></li>
<li><a href="https://x.com/behindruben">Twitter (X)</a></li>
<li><a href="https://github.com/rubenrookd">GitHub</a></li>
</ul>
</div>
</div>

<div id="outline-container-endeavors" class="outline-2">
<h2 id="endeavors">Current Endeavors</h2>
<div class="outline-text-2" id="text-endeavors">
<p>
Besides a slew of client work I've done through the years I don't really have much to show.
</p>

<p>
However I will be starting a new project known as Cooperative Distraction where I will be speaking out as a healthcare and social change advocate. We're in the beginning changes right now and haven't gotten much done from that, but I'm getting the ball rolling.
</p>

<p>
Read more about it in below.
</p>
</div>
</div>

<div id="outline-container-blogs" class="outline-2">
<h2 id="blogs">Latest Blogs</h2>
<div class="outline-text-2" id="text-blogs">
<p>
I'll be documenting my adventure in starting a movement for change. Check out my writing here:
</p>
<ul class="org-ul">
<li><a href="blog/archive.html">Visit the Blog Archive</a></li>
</ul>

<hr>
<section style="background: var(--accent-bg); padding: 1rem; border-radius: 5px;">
  <h3>Support My Work</h3>
  <p>If you enjoy my endeavors, or want to help the social change movement, please consider supporting!</p>
  <a href="https://www.paypal.com/ncp/payment/B2NNYT7XL3H7U">Donate via PayPal</a>
</section>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
